test/bench/evidence/20260714-1005-06dc4acd5/raw_write-linux-r2.log
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.hle [bit 4]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.rtm [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512f [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512dq [bit 17]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512cd [bit 28]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512bw [bit 30]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512vl [bit 31]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi [bit 1]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi2 [bit 6]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vnni [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512bitalg [bit 12]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512-vpopcntdq [bit 14]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.la57 [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=80000008h].EBX.wbnoinvd [bit 9]
cSeaBIOS (version rel-1.17.0-0-gb52ca86e094d-prebuilt.qemu.org)


iPXE (http://ipxe.org) 00:02.0 CA00 PCI2.10 PnP PMM+7EFD1900+7EF31900 CA00
                                                                               


Booting from ROM...
c[    0.321746] kvm_intel: VMX not supported by CPU 0
Running benchmark: fio/ext4_p9_param on linux
The VM is ready for the benchmark.
P9CFG mode=raw rw=write bs=1M nj=1 fsync=0 size=1G
P9CASE raw-write
raw-write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
fio-3.39
Starting 1 thread
Jobs: 1 (f=1)
raw-write: (groupid=0, jobs=1): err= 0: pid=95: Tue Jul 14 10:15:33 2026
  write: IOPS=4266, BW=4267MiB/s (4474MB/s)(1024MiB/240msec); 0 zone resets
    clat (usec): min=66, max=2563, avg=218.79, stdev=210.98
     lat (usec): min=77, max=2574, avg=233.30, stdev=211.22
    clat percentiles (usec):
     |  1.00th=[   70],  5.00th=[   71], 10.00th=[   72], 20.00th=[   75],
     | 30.00th=[   79], 40.00th=[   91], 50.00th=[  258], 60.00th=[  277],
     | 70.00th=[  289], 80.00th=[  310], 90.00th=[  367], 95.00th=[  445],
     | 99.00th=[  676], 99.50th=[ 1663], 99.90th=[ 2474], 99.95th=[ 2573],
     | 99.99th=[ 2573]
   bw (  MiB/s): min= 2043, max= 2043, per=47.90%, avg=2043.91, stdev= 0.00, samples=1
   iops        : min= 2043, max= 2043, avg=2043.00, stdev= 0.00, samples=1
  lat (usec)   : 100=43.16%, 250=6.15%, 500=47.95%, 750=1.76%, 1000=0.10%
  lat (msec)   : 2=0.49%, 4=0.39%
  cpu          : usr=4.60%, sys=84.52%, ctx=119, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4267MiB/s (4474MB/s), 4267MiB/s-4267MiB/s (4474MB/s-4474MB/s), io=1024MiB (1074MB), run=240-240msec
P9DONE raw-write
P9ALLDONE
[    1.935214] reboot: Power down